<template>
  <el-carousel :interval="5000" arrow="always" indicator-position="none" height="600px">
    <el-carousel-item v-for="(teacher, index) in list" :key="index">
      <div class="container">
        <img
          class="teacher-img"
          src="https://dummyimage.com/300x400/EEC591/FFF&text=teacher"
          alt
          width="300"
          height="400"
        />
        <div class="teacher-info">
          <p class="active">{{ teacher.name }}</p>
          <p class="info" v-for="(info, index) in teacher.info" :key="index">{{ info }}</p>
        </div>
      </div>
    </el-carousel-item>
  </el-carousel>
</template>

<script>
export default {
  data() {
    return {
      list: [
        {
          name: '周老师',
          info: `南京大学博士生导师；教育部长江学者特聘教授，国家杰出青年基金获得者；南京大学计算机科学与技术系副主任、软件新技术国家重点实验室常务副主任，机器学习与数据挖掘研究所所长，中国社会科学院大数据论坛客座研究员
2012年，当选IEEE Fellow（国际电气电子工程学会会士）和IAPR Fellow （国际模式识别学会会士）
2013年，当选CCF会士
2013，成为大陆高校首位当选ACM杰出科学家的学者
2016年，当选AAAI Fellow（国际人工智能学会），成为我国大陆第一位，也是此次入选的唯一来自美欧之外的学者，并且是唯一在中国大陆取得博士学位的AAAI Fellow
2016年12月，当选美国计算机学会会士（ACM Fellow），成为第一位在中国大陆取得全部学位的ACM Fellow
2017年2月，当选人工智能领域顶级学术会议 AAAI 2019 程序委员会主席，是该会议自1980年成立以来首位华人主席、也是首次由美欧之外国家的学者出任主席
`.split('\n'),
        },
        {
          name: '胡老师',
          info: `日本早稻田大学统计学博士,中国社会科学院大数据论坛客座研究员,曾任联想集团MIDH首席客座培训师
近三年在大数据与数据挖掘领域的期刊和会议上发表论文10篇，其中包括大数据领域最著名的国际期刊IEEE Transactions on Knowledge and Data Engineering上发表论文2篇；参与申请国家发明专利6项；参与编写大数据权威教材《大数据、数据挖掘与智慧运营（上）》
曾参与2015-2018年广西移动、上海移动、成都移动、杭州移动、山西移动的”大数据、数据挖掘与智慧运营”项目，全程担任初级、中级和高级讲师，获得领导学员的一致好评。所参与的项目获得2016年中国移动集团公司培训管理最佳实践案例奖
擅长的授课领域包括：大数据、人工智能、精准营销、区块链、金融风控等。具备10年以上授课经验，课程满意度在95%以上
`.split('\n'),
        },
        {
          name: '曾老师',
          info: `英国伦敦大学统计学专业博士；
北京邮电大学大数据产学研基地外聘专家
北京邮电大学硕士研究生兼职导师；
SPSS/SAS分析软件官方认证培训师；
曾任百合网大数据培训首席培训师；
曾任集奥聚合风控建模事业部高级总监；
数据统计、数据挖掘、机器学习领域的实战精英；
Excel、PPT、SPSS、SAS、R、Python实战达人；
近三年在大数据与数据挖掘领域的期刊和会议上发表论文8篇（包括大数据领域著名的国际学术期刊ACM Transactions on Database Systems）；担任大数据权威教材《大数据、数据挖掘与智慧运营（ 上）》统稿人，清华大学出版社，2017年出版。
2017年，所支撑的项目获得中国移动集团公司颁发的”管理创新一等奖”。
擅长的授课领域包括：大数据、人工智能、精准营销、区块链、金融风控等。具备10年以上授课经验， 课程满意度在95%以上。
`.split('\n'),
        },
        {
          name: '梁老师',
          info: `北京邮电大学博士，英国玛丽女王大学访问学者；
工信部大数据产学研基地专家；
北京邮电大学硕士研究生导师；
阿里巴巴大数据研究院客座科学家；
曾任中国移动广西公司”桂和杯”大数据建模大赛总评委；
曾任乐视移动大数据与人工智能首席顾问；
曾任工信部高级职称评聘出题人；
曾与中国移动、联想集团、乐视移动、阿里巴巴、大唐电信、海南航空、北京现代等知名企业合作开展多个项目，发表学术论文30多篇，撰写学术专著3本，申请科技发明专利20余项，已获得授权8项，多个核心期刊的审稿人，曾参与、主持科研项目10余项；
目前主要研究方向为大数据挖掘与人工智能技术在企业智慧运营中的应用，完成相关培训项目10多个， 合计项目经费已超过500万，并支撑客户获得中国移动集团公司颁发的“最佳培训实践案例奖”和“管理创新一等奖”
擅长的授课领域包括：大数据、人工智能、5G、物联网、云计算与雾计算、精准营销、区块链、金融风控等。具备20年授课经验，课程满意度在95%以上。
`.split('\n'),
        },
        {
          name: '唐老师',
          info: `北京大学计算机硕士，美国Carnegie Mellon大学计算机博士；
阿里巴巴大数据与云计算事业部总监级工程师；
“天池”大数据竞赛评委；
北京邮电大学硕士研究生兼职导师；
带领团队完成了阿里巴巴的多项大数据攻关项目，具备丰富的大数据实战经验；
发表学术论文4篇，申请发明专利9项，参与编写专著1本；
大数据权威教材《大数据、数据挖掘与智慧运营》配套软件的开发者；
曾参与2015-2018年广西移动、上海移动、山西移动、成都移动、杭州移动“大数据、数据挖掘与智慧运营”项目，全程担任初级、中级和高级讲师，获得领导和学员的一致好评。所参与的项目于2016年获得中国移动集团公司颁发的“最佳培训实践案例奖”。
擅长大数据与云计算架构设计、算法设计和用户行为分析，精通Hadoop、Spark、Hive、Hbase、Yarn等大数据生态组件，熟悉自然语言处理、人工智能。具备10年以上授课经验，课程满意度在95%以上。
`.split('\n'),
        },
        {
          name: '鲁老师',
          info: `大数据与人工智能专业博士；
主要研究方向：基于大数据的客户行为分析；
曾任乐视移动大数据事业部高级培训师；
曾IEEE Big Data Forum Member；
曾任光环国际大数据培训课程高级培训师；
曾任CDA大数据培训课程高级培训师；
国内第一本专门面向运营商的大数据专著的主要作者；
近三年在大数据领域的期刊和会议上发表论文10篇，其中包括大数据领域最著名的国际学术会议IEEE International Conference on Data Mining上发表论文3篇；参与申请国家发明专利4项；参与编写大数据权威教材《大数据、数据挖掘与智慧运营》，清华大学出版社，2017年出版；
曾参与2014-2018年广西移动、上海移动、山西移动、成都移动、杭州移动“大数据、数据挖掘与智慧运营”项目，全程担任初级、中级和高级讲师，获得领导和学员的一致好评。所支撑的项目获得中国移动集团公司颁发的“最佳培训实践案例奖”和“管理创新一等奖”；
擅长大数据、数据挖掘、云计算、物联网、客户网络行为分析、客户消费行为分析、精准营销等系列课程。5年行业授课经验，课程满意度在95%以上。
`.split('\n'),
        },
        {
          name: '王老师',
          info: `大数据与人工智能专业博士；
主要研究方向：基于大数据架构的网络建维优智能系统研发；
曾任乐视移动大数据事业部高级培训师；
曾任联想集团MIDH高级客座培训师；
曾任光环国际大数据培训课程高级培训师；
曾任CDA大数据培训课程高级培训师；
曾带领团队完成2项基于大数据架构的网络建维优智慧运营平台，其中中国移动和中国联通项目各1项；具备丰富的系统开发经验；
近三年在大数据领域的期刊和会议上发表论文4篇，参与申请国家发明专利2项，申请软件著作权2项；参与编写大数据权威教材《大数据、数据挖掘与智慧运营》，清华大学出版社，2017年出版；
曾参与2016-2018年广西移动、上海移动、山西移动、成都移动、杭州移动“大数据、数据挖掘与智慧运营”项目，全程担任初级、中级和高级讲师，获得领导和学员的一致好评。所支撑的项目获得中国移动集团公司颁发的“最佳培训实践案例奖”和“管理创新一等奖”；
擅长大数据、数据挖掘、云计算、物联网、客户网络行为分析、客户消费行为分析、精准营销等系列课程。5年行业授课经验，课程满意度在95%以上。
`.split('\n'),
        },
        {
          name: '李老师',
          info: `大数据与人工智能专业博士；
主要研究方向：基于大数据架构的精准营销系统研发；
曾任乐视移动大数据事业部高级培训师；
曾任光环国际大数据培训课程高级培训师；
曾任CDA大数据培训课程高级培训师；
独自带领团队完成3个基于大数据架构的精准营销系统开发，熟悉数据采集、存储、计算、安全、建模、应用的全部流程，具备丰富的系统开发经验；
近三年在大数据领域的期刊和会议上发表论文3篇，参与申请国家发明专利1项，申请软件著作权2项；参与编写大数据权威教材《大数据、数据挖掘与智慧运营》，清华大学出版社，2017年出版；
曾参与2016-2018年广西移动、上海移动、山西移动、成都移动、杭州移动“大数据、数据挖掘与智慧运营”项目，全程担任初级、中级和高级讲师，获得领导和学员的一致好评。所支撑的项目获得中国移动集团公司颁发的“最佳培训实践案例奖”和“管理创新一等奖”；
擅长大数据、数据挖掘、云计算、物联网、客户网络行为分析、客户消费行为分析、精准营销等系列课程。5年行业授课经验，课程满意度在95%以上。
`.split('\n'),
        },
      ],
    }
  },
}
</script>

<style lang="scss" scoped>
.teacher-img {
  border-radius: 5px;
  box-shadow: 0 4px 8px 0 rgba(7, 17, 27, 0.1);
  position: absolute;
  top: 50%;
  right: 200px;
  -webkit-transform: translateY(-50%);
  transform: translateY(-50%);
}
.teacher-info {
  position: absolute;
  top: 50%;
  -webkit-transform: translateY(-50%);
  transform: translateY(-50%);
  width: 850px;
  left: 200px;
  font-size: 20px;
  font-weight: 300;
  color: #3f3f3f;
  line-height: 30px;
  .active {
    font-size: 32px;
    font-weight: 400;
    color: #ff4500;
    margin-bottom: 20px;
  }
  p.info {
    line-height: 26px;
    font-size: 18px;
    color: #3f3f3f;
    margin-top: 14px;
  }
}
.container {
  position: relative;
  height: 600px;
}
.el-carousel {
  .el-carousel__arrow.el-carousel__arrow--left {
    border-radius: 0;
  }
}
</style>
